// Написать программу, которая на вход принимает число и выдает его квадрат.
// Например: 
// 2 -> 4, 
// -3 -> 9 и тд.

System.Console.WriteLine("Это моя программа ССВ");
int value = 10;
int result = value * value;
Console.WriteLine($"result:{result}");


